app/views/orders/index.html.erb

      <tr>
        <td><%= Product.find(order.product_id).price %></td>
        <td><%= Product.find(order.product_id).title %></td>
        <td><%= Product.find(order.product_id).description %></td>
        <td><%= Product.find(order.product_id).category.name %></td>
        <td><%= Product.find(order.product_id).brand.name %></td>
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT  `brands`.* FROM `brands` WHERE `brands`.`id` = 1 LIMIT 1

          <div>
            <% Product.find(order.product_id).images.each do |image| %>
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]


        <% if Product.find(order.product_id).quantity > 0 %>
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]