app/controllers/brands_controller.rb

SELECT `brands`.* FROM `brands`
---
  def index
    @brands = Brand.all

INSERT INTO `brands` (`name`, `created_at`, `updated_at`) VALUES ('samsung', '2019-05-01 04:11:40', '2019-05-01 04:11:40')
---
  def create
    @brand = Brand.new(brand_params)

    respond_to do |format|
      if @brand.save

DELETE FROM `brands` WHERE `brands`.`id` = 2
---
  def destroy
    @brand.destroy

SELECT  `brands`.* FROM `brands` WHERE `brands`.`id` = 1 LIMIT 1
---
    def set_brand
      @brand = Brand.find(params[:id])