app/controllers/categories_controller.rb

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('Electronics', '2019-05-01 04:18:20', '2019-05-01 04:18:20')
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save