app/controllers/orders_controller.rb

  def index
    @orders = Order.where(user_id: current_user.id).all
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 2

  def get_seller_orders
   @sellerOrders = (Order.where(:product_id => Product.where(:user_id => current_user.id)))
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`product_id` IN (SELECT `products`.`id` FROM `products` WHERE `products`.`user_id` = 5)

  def update

    if (current_user.role == "buyer")
      @order.state=1
    end
    if (current_user.role == "seller")
      if (@order.state == "confirmed")
        @order.state=3

      end
      if (@order.state == "pending")
        @order.state=2
        @product=@order.product
        @product.quantity-=1
        @product.save
      end
    end
    redirect_back(fallback_location: root_path)
    @order.save
---
UPDATE `orders` SET `state` = 1, `updated_at` = '2019-05-07 21:04:55' WHERE `orders`.`id` = 2

    def set_order
      @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 2 LIMIT 1