app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT `orders`.* FROM `orders`

  def create()
    puts "doha"
    @order = Order.new()
    @order.state=0
    @order.save

    respond_to do |format|
      if @order.save
---
INSERT INTO `orders` (`created_at`, `updated_at`) VALUES ('2019-05-04 12:16:20', '2019-05-04 12:16:20')
INSERT INTO `orders` (`created_at`, `updated_at`, `user_id`, `product_id`) VALUES ('2019-05-04 18:24:02', '2019-05-04 18:24:02', 1, 1)

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE `orders` SET `state` = 1, `updated_at` = '2019-05-05 01:00:49' WHERE `orders`.`id` = 30

  def destroy
    @order.destroy
---
DELETE FROM `orders` WHERE `orders`.`id` = 1