app/controllers/products_controller.rb

  def index
    @products = Product.search(params[:search])
---
SELECT `products`.* FROM `products`

  def create
    @product = Product.new(product_params)
    product_associatives(@product, params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`price`, `quantity`, `title`, `description`, `created_at`, `updated_at`, `brand_id`, `category_id`, `user_id`) VALUES (0.0, 30, 'aaaaaaaaaaaaaa', 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa', '2019-05-02 18:44:45', '2019-05-02 18:44:45', 1, 1, 2)

  def update
    product_associatives(@product, params[:product])
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `updated_at` = '2019-05-04 14:37:02' WHERE `products`.`id` = 1

    def product_associatives(product, parameters)
      product.user = current_user
      product.brand = Brand.find(parameters[:brand])
      product.category = Category.find(parameters[:category])
---
SELECT  `brands`.* FROM `brands` WHERE `brands`.`id` = 3 LIMIT 1
SELECT  `brands`.* FROM `brands` WHERE `brands`.`id` = 1 LIMIT 1
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1