app/controllers/shopping_carts_controller.rb

SELECT `shopping_carts`.* FROM `shopping_carts`
---
  def index
    @shopping_carts = ShoppingCart.all

SELECT  `users`.* FROM `users` ORDER BY `users`.`id` DESC LIMIT 1
INSERT INTO `shopping_carts` (`created_at`, `updated_at`, `user_id`) VALUES ('2019-05-03 08:33:04', '2019-05-03 08:33:04', 1)
---
  def self.create
    @shopping_cart = ShoppingCart.new()
    @shopping_cart.user = User.last


    @shopping_cart.save

SELECT  `shopping_carts`.* FROM `shopping_carts` WHERE `shopping_carts`.`id` = 1 LIMIT 1
---
    def set_shopping_cart
      @shopping_cart = ShoppingCart.find(params[:id])