app/models/copon.rb

    def is_expired
        if expiration_type == "usage"
            get_usage.length == get_expiration
---
SELECT `used_copons`.* FROM `used_copons` WHERE (copon_id)