app/models/user.rb

UPDATE `users` SET `role` = 1, `updated_at` = '2019-05-04 14:54:31' WHERE `users`.`id` = 1
---
  def self.assign_role(user, role)
    user.role = role
    user.save