app/views/products/_form.html.erb

SELECT `brands`.* FROM `brands`
---
    <%= form.select(:brand) do %>
      <% brands_array = Brand.all.collect { |b| [b.name, b.id] } %>

SELECT `categories`.* FROM `categories`
---
    <%= form.select(:category) do %>
      <% categories_array = Category.all.collect { |c| [c.name, c.id] } %>